Wall_v1_again_fixed_clean/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Uref                 1;
Zref                 0.6;
zDir                 (0 1 0);
flowDir              (1 0 0);
z0                   uniform 0.03;
zGround              uniform 0;
value                $internalField;

// ************************************************************************* //
