Wall_v1_again_fixed_clean/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (0 0 0);
pressure             0;
turbulentKE          0.228;
turbulentEpsilon     0.019;
turbulentOmega       0.082;

// ************************************************************************* //
 
