Wall_v1_again_fixed_clean/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
 //  #include "include/ABLConditions"
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }   

    ground
    {
        type            nutkAtmRoughWallFunction;
        z0              0.001;
        value           uniform 0.001;
        
    }



    buildings
{
        type            nutkAtmRoughWallFunction;
        z0              0.001;
        value           uniform 0.001;
    }

    WERFL
{
        type            nutkAtmRoughWallFunction;
        z0              0.001;
        value           uniform 0.001;
    }

block_front
{
       type            nutkAtmRoughWallFunction;
        z0              0.001;
        value           uniform 0.001;
    }




    
frontAndBack
{
        type            nutkAtmRoughWallFunction;
        z0              0.001;
        value           uniform 0.001;
    }


}

// ************************************************************************* //
