Wall_v1_again_fixed_clean/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            totalPressure;
        p0              uniform 0;
        gamma           1.4;
        value           uniform 0;
    }

   

    ground
    {
        type            zeroGradient;
    }

 
     buildings
{
     type            zeroGradient;
    }

    WERFL
{
     type            zeroGradient;
    }



frontAndBack
{
    type zeroGradient;
}


    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
