Wall_v1_again_fixed_clean/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       on;

geometry
{
    buildings
    {
        type triSurfaceMesh;
        file "buildings.stl";
    }

    WERFL
    {
        type triSurfaceMesh;
        file "WERFL.stl";
    }

    refinementBox
    {
        type searchableBox;
        min  (8   0   1.5);
        max   (16  3  5);
    }

    refinementBox2
    {
        type searchableBox;
        min  (12.5   0   2);
        max   (17  1  4);
    }

};

castellatedMeshControls
{
    
//Refinement parameters
    nCellsBetweenLevels 3;


  //Explicit feature EDGE refinement
    features
    (
      { file  "buildings.eMesh"; level 2; }
    );
    (
      { file  "WERFL.eMesh"; level 3; }
    );


   // SURFACE based refinement
    refinementSurfaces
    {
        buildings
        {
            level (2 2);
            patchInfo { type wall; }
        }

        WERFL
        {
            level (3 3);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((1E15 1));
        }

        refinementBox2
        {
            mode inside;
            levels ((1E15 2));
        }

    }

    locationInMesh (8 1 3);
}

snapControls
{
// Number of patch smoothing iterations before finding correspondence
    // to surface
    nSmoothPatch 3;

    // Maximum relative distance for points to be attracted by surface.
    // True distance is this factor times local maximum edge length.
    // Note: changed(corrected) w.r.t 17x! (17x used 2* tolerance)
    tolerance 2.0;

    // Number of mesh displacement relaxation iterations.
    nSolveIter 40;  //30 is default     //60 worked for me in TC 102

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 15;   //5 is default   //15 worked for me in TC 102

    // Feature snapping

        // Number of feature edge snapping iterations.
        // Leave out altogether to disable.
        nFeatureSnapIter 20;   //10 is default   //20 worked for me in TC 102
        // Detect (geometric only) features by sampling the surface
        // (default=false).
        implicitFeatureSnap false;

        // Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap true;

        // Detect features between multiple surfaces
        // (only for explicitFeatureSnap, default = false)
        multiRegionFeatureSnap false;



}

addLayersControls
{
//Global parameters
relativeSizes true;
expansionRatio 1.1;
finalLayerThickness 0.5;
minThickness 1e-3;;

    layers
    {
       buildings// "CAD.*"
        {
            nSurfaceLayers 5;
        }

       WERFL// "CAD.*"
        {
            nSurfaceLayers 12;
        }

 ground// "CAD.*"
        {
            nSurfaceLayers 5;
        }

 frontAndBack// "CAD.*"
        {
            nSurfaceLayers 5;
        }
    }


}

// Advanced settings
nGrow 0;
featureAngle 130;
maxFaceThicknessRatio 0.5;
nSmoothSurfaceNormals 1;
nSmoothThickness 10;
minMedianAxisAngle 90;
maxThicknessToMedialRatio 0.3;
nSmoothNormals 3;
slipFeatureAngle 30;
nRelaxIter 5;
nBufferCellsNoExtrude 0;
nLayerIter 50;
nRelaxedIter 20;



}

meshQualityControls
{
   #include "meshQualityDict"

    relaxed
{
   maxNonOrtho 75;
}

      nSmoothScale 4;
      errorReduction 0.75;
}

writeFlags
(
    noRefinement
    // scalarLevels
    // layerSets
    // layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
